<?php

namespace App\Http\Controllers\Api;

class OrdController extends Controller
{
    public function getOrdList()
    {
        $sql = @"
            SELECT 客户订单子表.订单编号,   
                客户订单子表.订单序号,   
                客户订单子表.产品系统编号,   
                客户订单子表.产品明细编号,   
                客户订单子表.数量,   
                客户订单子表.币种,   
                客户订单子表.汇率,   
                客户订单子表.单价,   
                客户订单子表.金额,   
                客户订单子表.本币金额,   
                客户订单子表.订单交期,   
                客户订单子表.明细备注,   
                客户订单子表.排序,   
                客户订单子表.创建人,   
                客户订单子表.创建时间,   
                客户订单子表.修改人,   
                客户订单子表.修改时间,   
                客户订单子表.删除,   
                客户订单子表.删除人,   
                客户订单子表.删除时间,   
                客户订单子表.完成,   
                客户订单子表.完成人,   
                客户订单子表.完成时间,   
                客户订单子表.强制完成,   
                客户订单子表.取消,   
                客户订单子表.取消人,   
                客户订单子表.取消时间,    
                客户订单子表.序号,   
                产品主表.产品编号,   
                产品主表.名称,   
                产品主表.规格,   
                产品主表.产品属性1,   
                产品主表.产品属性2,   
                产品主表.产品属性3,   
                产品主表.产品属性4,   
                产品主表.产品属性5,   
                产品子表.明细规格,   
                产品子表.产品明细属性1,   
                产品子表.产品明细属性2,   
                产品子表.产品明细属性3,    
                客户订单主表.订单日期,   
                客户订单主表.订单类型,   
                客户订单主表.客户系统编号,   
                客户订单主表.客户单号,   
                客户订单主表.合同编号,   
                客户订单主表.内外销别,   
                客户订单主表.价格条款,   
                客户订单主表.结算方式,   
                客户订单主表.运输方式,   
                客户订单主表.业务员,   
                客户订单主表.出货地址,   
                客户订单主表.备注,   
                客户订单主表.审核,   
                客户订单主表.审核人,   
                客户订单主表.审核时间,   
                Company.公司编号,   
                Company.CompSimple,   
                Company.helpid,   
                Company.kindid,   
                产品主表.客户产品号,   
                (select isnull(sum(数量),0) from 成品出入库主表 a,成品出入库子表 b where a.单据编号=b.单据编号 and a.出入类型='出库' and b.订单序号=客户订单子表.订单序号 and a.删除=0 and b.删除=0 and a.审核=1) as '已出库量',   
                datediff(day,客户订单子表.订单交期,getdate()) as '未完成天数',   
                产品主表.客户系统编号  
            FROM 客户订单子表 LEFT OUTER JOIN 产品子表 ON 客户订单子表.产品明细编号 = 产品子表.产品明细编号 LEFT OUTER JOIN 产品主表 ON 客户订单子表.产品系统编号 = 产品主表.产品系统编号, 客户订单主表 LEFT OUTER JOIN Company ON 客户订单主表.客户系统编号 = Company.CompID  
            WHERE ( 客户订单子表.订单编号 = 客户订单主表.订单编号 ) and  
                    ( 客户订单子表.删除 = 0 ) AND  
                    ( 客户订单主表.删除 = 0 ) AND  
                    ( 客户订单主表.审核 = 1 ) AND  
                    ( 客户订单子表.取消 = 0 ) AND  
                        客户订单子表.完成 = 0 and 
                    ((DateDiff(Day,GetDate(),客户订单子表.订单交期)<=14 and 客户订单子表.订单交期>getdate()) OR (客户订单子表.订单交期<getdate())) 
            order by Company.公司编号
        ";

        $list = \DB::connection('sqlsrv')->select($sql);
        return $this->success(
            [
                'list' => $list,
            ]
        );

    }
}
